{
    "Dnd-Scenario": "Raising Your Asian Child (Helicopter Parent Edition)",         
    "attributes": {
      "Academic Pressure": "Your ability to push for educational excellence. Determines effectiveness in enforcing study habits, test preparation, and grade expectations.",
      "Tiger Discipline": "Your strictness and enforcement of rules. Essential for maintaining rigid schedules, proper behavior, and high standards in all aspects of life.",
      "Social Engineering": "Your skill at controlling your child's social environment. Crucial for managing friendships, extracurricular activities, and building the perfect college application.",
      "Family Honor": "Your commitment to upholding cultural traditions and family reputation. Affects how well your child represents the family and respects ancestral values.",
      "Resource Management": "Your ability to optimize time, money, and connections. Determines how effectively you can provide advantages like tutoring, lessons, and networking opportunities.",
      "Emotional Tactics": "Your skill at psychological motivation techniques. Influences how you leverage guilt, comparison, and conditional approval to ensure compliance."
    },
    "baseSkills": {
      "Test Prep Drilling": {"attribute": "Academic Pressure", "description": "Conducting intensive study sessions and practice tests to ensure top scores on every examination."},
      "Grade Negotiation": {"attribute": "Academic Pressure", "description": "Confronting teachers about marks and assignments, ensuring your child receives every possible point."},
      "Strict Scheduling": {"attribute": "Tiger Discipline", "description": "Creating and enforcing a regimented timetable with minimal free time to maximize productivity."},
      "Punishment System": {"attribute": "Tiger Discipline", "description": "Implementing appropriate consequences for any performance below expectations or rule violations."},
      "Playdate Vetting": {"attribute": "Social Engineering", "description": "Carefully selecting acceptable friends based on their academic performance and parental occupation."},
      "Activity Monitoring": {"attribute": "Social Engineering", "description": "Maintaining surveillance on all social interactions and swiftly intervening when necessary."},
      "Relative Comparison": {"attribute": "Family Honor", "description": "Motivating your child through direct comparisons to cousins and other family members' achievements."},
      "Cultural Tradition Enforcement": {"attribute": "Family Honor", "description": "Ensuring rigorous participation in cultural practices, language learning, and family obligations."},
      "Educational Investment": {"attribute": "Resource Management", "description": "Allocating financial resources to the optimal combination of schools, programs, and educational materials."},
      "Schedule Optimization": {"attribute": "Resource Management", "description": "Maximizing each day's productive hours through careful planning and elimination of time-wasting activities."},
      "Guilt Induction": {"attribute": "Emotional Tactics", "description": "Reminding your child of family sacrifices made for their benefit to motivate greater effort and performance."},
      "Conditional Approval": {"attribute": "Emotional Tactics", "description": "Strategically providing love and praise only when expectations are met or exceeded."}
    },
    "startingPoint": "First Parent-Teacher Conference of the School Year",
    "playerCustomizations": {
      "parentingStyle": {
        "description": "Choose your helicopter parenting specialization",
        "content": {
          "Academic Taskmaster": {
            "description": "You are singularly focused on grades, test scores, and academic rankings. Nothing matters more than perfect report cards and admission to elite universities.",
            "attributeBonus": {"Academic Pressure": 2, "Emotional Tactics": 1}
          },
          "Prestige Climber": {
            "description": "You obsessively collect status symbols and connections. Every activity must enhance your child's resume and your family's standing in the community.",
            "attributeBonus": {"Social Engineering": 2, "Resource Management": 1}
          },
          "Cultural Purist": {
            "description": "You emphasize cultural heritage above all else. Your child must be fluent in your native language, respect traditions, and never become 'too Westernized.'",
            "attributeBonus": {"Family Honor": 2, "Tiger Discipline": 1}
          },
          "Future Planner": {
            "description": "You've mapped out your child's entire life through retirement. Every decision from elementary school to career choice has already been determined.",
            "attributeBonus": {"Resource Management": 2, "Academic Pressure": 1}
          },
          "Talent Maximizer": {
            "description": "You're determined that your child will master multiple skills to perfection. Piano, violin, competitive math, and Olympic swimming are just the beginning.",
            "attributeBonus": {"Tiger Discipline": 2, "Social Engineering": 1}
          }
        }
      },
      "familyBackground": {
        "description": "Choose your family's background and values",
        "content": {
          "Traditional Immigrant": {
            "description": "First-generation immigrant who sacrificed everything for a better life. Your child must achieve success to justify the hardships you endured.",
            "attributeBonus": {"Family Honor": 2, "Emotional Tactics": 1}
          },
          "Elite Professional": {
            "description": "Doctor, lawyer, or engineer with prestigious credentials. Your child must meet or exceed your professional success to maintain family standards.",
            "attributeBonus": {"Academic Pressure": 2, "Resource Management": 1}
          },
          "Academic Legacy": {
            "description": "Family with generations of scholarly achievement and elite university attendance. Anything less than continuing this tradition is unthinkable.",
            "attributeBonus": {"Family Honor": 1, "Academic Pressure": 2}
          },
          "Entrepreneurial Success": {
            "description": "Self-made business achiever who built success through relentless hard work. Your child must demonstrate similar drive and results-oriented thinking.",
            "attributeBonus": {"Tiger Discipline": 2, "Resource Management": 1}
          },
          "Competitive Community": {
            "description": "Living in an area where all parents are intensely involved and comparing children. Your parenting is constantly observed and judged by peers.",
            "attributeBonus": {"Social Engineering": 2, "Emotional Tactics": 1}
          }
        }
      }
    }
}
  